In [1]:
import pandas as pd

# 시리즈 만들기
* pd.Series(리스트)
* 시리즈 : 엑셀시트의 열 1개를 의미한다.(1차원 리스트형태)

In [2]:
# 시리즈 만들기
s = pd.Series(['amy',170,240])
print(s) # 앞의 0,1,2 는 시리즈의 인덱스
print(s.index)

0    amy
1    170
2    240
dtype: object
RangeIndex(start=0, stop=3, step=1)

In [3]:
#타입 확인하기
type(s)

pandas.core.series.Series

# 시리즈의 index와 value 가져오기
* 시리즈에는 index와 value가 있다.
* 시리즈의 index 가져오기 : 시리즈.index
* 시리즈의 value 가져오기 : 시리즈.values
* 시리즈의 인덱스는 리스트의 인덱스와 다른개념이다
  시리즈의 인덱스는 데이터의 이름이고, 행번호는 따로있다.

In [29]:
# 시리즈 인덱스 가져오기
s.index

RangeIndex(start=0, stop=3, step=1)

In [30]:
# 시리즈 데이터 가져오기
s.values  # 리스트의 형태이지만, 리스트는 아니다!! 타입은 오브젝트!

array(['amy', 170, 240], dtype=object)

# 시리즈의 index 지정하기
- 시리즈.index = 인덱스리스트
- 시리즈의 인덱스는 숫자, 문자열 모두 가능하다.

In [31]:
# 시리즈 인덱스 지정하기
s.index = ['name','height','footsize']
# 시리즈 출력하기
s # 2차원의 형태는 아니다.

name        amy
height      170
footsize    240
dtype: object

In [32]:
# 인덱스 확인하기
s.index

Index(['name', 'height', 'footsize'], dtype='object')

In [33]:
# 데이터 확인하기
s.values

array(['amy', 170, 240], dtype=object)

# 시리즈의 통계값 사용하기
- 평균: 시리즈.mean()
- 최소값: 시리즈.min()
- 최대값: 시리즈.max()
- 중간값: 시리즈.median()
- 표준편차: 시리즈.std()
    
- 시리즈의 통계값은 시리즈의 value가 모두 숫자형일 때 사용할 수 있다.

In [34]:
s2 = pd.Series([10,20,30,40,50])

In [35]:
print('평균', s2.mean())
print('최소값',s2.min())
print('최대값',s2.max())
print('중간값',s2.median())
print('표준편차',s2.std())

평균 30.0
최소값 10
최대값 50
중간값 30.0
표준편차 15.811388300841896

- 요약통계 : 시리즈.describe()

In [36]:
s2.describe()

count     5.000000
mean     30.000000
std      15.811388
min      10.000000
25%      20.000000
50%      30.000000
75%      40.000000
max      50.000000
dtype: float64

# 시리즈 주요 메서드
- 값 정렬: 시리즈.sort_values()
- 인덱스 정렬: 시리즈.sort_index()
- 인덱스 리셋: 시리즈.reset_index() -> 행번호로 인덱스 재지정
- 특정 값을 가진 시리즈 값을교체: replace(찾을값,교체할값)
- 시리즈를 데이터프레임으로 변환: 시리즈.to_frame()

In [37]:
s3 = pd.Series([1,3,2,4,10])

In [38]:
# s3의 value 중 10을 5로 교체
s3 = s3.replace(10,5)
s3

0    1
1    3
2    2
3    4
4    5
dtype: int64

In [39]:
# s3 정렬 (디폴트는 오름차순 : ascending=True)
s3.sort_values()

0    1
2    2
1    3
3    4
4    5
dtype: int64

In [40]:
# s3 정렬 (내림차순 : ascending=False)
s3.sort_values(ascending=False)

4    5
3    4
1    3
2    2
0    1
dtype: int64

In [41]:
# s3을 데이터프레임으로 만들기
s3.to_frame() # 하나의 컬럼을 가진 데이터 프레임으로 변경

   0
0  1
1  3
2  2
3  4
4  5

In [42]:
# 시리즈 인덱스 새로 만들기 
s3.reset_index()

   index  0
0      0  1
1      1  3
2      2  2
3      3  4
4      4  5

In [43]:
s

name        amy
height      170
footsize    240
dtype: object

In [44]:
s.reset_index()

      index    0
0      name  amy
1    height  170
2  footsize  240

In [45]:
##

In [46]:
## 시리즈 형태로 하나의 열 데이터 추출하기 
# 데이터프레임['컬럼명']
# 데이터프레임.컬럼명 -> 컬럼명에 공백이나 특수문자가 들어가는 경우 사용할 수 없다

In [47]:
## 데이터프레임 형태로 여러 열 단위 데이터
# 데이터프레임[컬럼명리스트]
# 데이터프레임[['컬럼명1','컬럼명2', ... ]]

In [51]:
import pandas as pd
df = pd.read_csv('data/scores.csv')
df.head(3)

      name    kor    eng   math
0    Aiden  100.0   90.0   95.0
1  Charles   90.0   80.0   75.0
2   Danial   95.0  100.0  100.0

# 컬럼명으로 데이터 추출하기

## 시리즈 형태로 추출하기
- 데이터프레임명['컬럼명'] or 데이터프레임명["컬럼명"]
   : 컬럼명은 1개만 지정할 수 있으며 대괄호 1개를 사용한다.
- 데이터프레임명.컬럼명
   : 컬럼명에 공백이나 특수문자가 섞여있을 때는 사용할 수 없다.

In [52]:
# 'name' 컬럼 추출하기
s_name = df['name']
s_name.head(3)

0      Aiden
1    Charles
2     Danial
Name: name, dtype: object

In [53]:
# type
type(s_name)

pandas.core.series.Series

In [54]:
# index
s_name.index

RangeIndex(start=0, stop=30, step=1)

In [55]:
# value
s_name.values

array(['Aiden', 'Charles', 'Danial', 'Evan', 'Henry', 'Ian', 'James',
       'Julian', 'Justin', 'Kevin', 'Leo', 'Oliver', 'Peter', 'Amy',
       'Chloe', 'Danna', 'Ellen', 'Emma', 'Jennifer', 'Kate', 'Linda',
       'Olivia', 'Rose', 'Sofia', 'Tiffany', 'Vanessa', 'Viviana',
       'Vikkie', 'Winnie', 'Zuly'], dtype=object)

In [56]:
# shape
s_name.shape

(30,)

In [58]:
# '영어' 컬럼 추출하기
df.eng

0      90.0
1      80.0
2     100.0
3     100.0
4      35.0
5     100.0
6      75.0
7      90.0
8      60.0
9     100.0
10     95.0
11     75.0
12     95.0
13     75.0
14    100.0
15    100.0
16     60.0
17     65.0
18     55.0
19      NaN
20     90.0
21     70.0
22     65.0
23    100.0
24      NaN
25     70.0
26     80.0
27     50.0
28    100.0
29     90.0
Name: eng, dtype: float64

In [59]:
# '수학' 컬럼 추출하기
df.math.head(3)

0     95.0
1     75.0
2    100.0
Name: math, dtype: float64

## 데이터프레임 형태로 추출하기
- 데이터프레임명[컬럼명리스트]
- 대괄호안에 컬럼리스트가 들어간다.(대괄호 2개로 표현되어야한다.)

In [60]:
# '이름','국어' 컬럼 데이터 추출하기
df_name_kor = df[['name','kor']]
df_name_kor

        name    kor
0      Aiden  100.0
1    Charles   90.0
2     Danial   95.0
3       Evan  100.0
4      Henry    NaN
5        Ian   90.0
6      James   70.0
7     Julian   80.0
8     Justin   50.0
9      Kevin  100.0
10       Leo   90.0
11    Oliver   70.0
12     Peter  100.0
13       Amy   90.0
14     Chloe   95.0
15     Danna  100.0
16     Ellen    NaN
17      Emma   70.0
18  Jennifer   80.0
19      Kate   50.0
20     Linda  100.0
21    Olivia   90.0
22      Rose   70.0
23     Sofia  100.0
24   Tiffany   90.0
25   Vanessa   95.0
26   Viviana  100.0
27    Vikkie    NaN
28    Winnie   70.0
29      Zuly   80.0

In [61]:
# '수학' 컬럼을 데이터프레임 형태로 추출하기
df_math = df[['math']].head(3)
df_math

    math
0   95.0
1   75.0
2  100.0

In [62]:
# type
type(df_math) ## 시리즈와의 차이점.. 대괄호 2개..

pandas.core.frame.DataFrame

## 조건에 따라 데이터 추출하기

In [63]:
#      비교연산자                     논리연산자
#  >   Less than                 &     and
#  <   Greater than              |     or
#  ==  Equals                    ~     not
#  >=  Less than or equals       ^     xor
#  <=  Greater than or equals
#  !=  Not equal to

# 논리연산자를 사용하는 경우 각 조건을 소괄호()로 묶어주어야 한다.

### 조건의 결과에 따른 불린인덱스 추출
- 조건식의 결과에 따른 결과가 불린인덱스로 만들어진다.

In [65]:
# 국어 점수가 100점인 데이터 불린인덱스
df['kor'] == 100

0      True
1     False
2     False
3      True
4     False
5     False
6     False
7     False
8     False
9      True
10    False
11    False
12     True
13    False
14    False
15     True
16    False
17    False
18    False
19    False
20     True
21    False
22    False
23     True
24    False
25    False
26     True
27    False
28    False
29    False
Name: kor, dtype: bool

### 불린인덱스로 데이터 추출
- 불린인덱스를 데이터프레임명[]으로 감싸주면 True인 데이터만 추출된다.

In [66]:
# 국어 점수가 100점인 데이터 추출
df[df['kor'] == 100]

       name    kor    eng   math
0     Aiden  100.0   90.0   95.0
3      Evan  100.0  100.0  100.0
9     Kevin  100.0  100.0   90.0
12    Peter  100.0   95.0  100.0
15    Danna  100.0  100.0  100.0
20    Linda  100.0   90.0  100.0
23    Sofia  100.0  100.0  100.0
26  Viviana  100.0   80.0  100.0

### 여러 조건
- 논리연산자는 '&','|','~','^' 기호를 사용한다.
- 논리연산자를 사용할 때에는 각 조건을 ()로 감싼다.

In [67]:
# 한 과목이라도 100을 받은 학생 추출
df[
    (df.kor==100)|(df.eng==100)|(df.math==100)
]

       name    kor    eng   math
0     Aiden  100.0   90.0   95.0
2    Danial   95.0  100.0  100.0
3      Evan  100.0  100.0  100.0
5       Ian   90.0  100.0   90.0
8    Justin   50.0   60.0  100.0
9     Kevin  100.0  100.0   90.0
12    Peter  100.0   95.0  100.0
14    Chloe   95.0  100.0   95.0
15    Danna  100.0  100.0  100.0
20    Linda  100.0   90.0  100.0
23    Sofia  100.0  100.0  100.0
26  Viviana  100.0   80.0  100.0
27   Vikkie    NaN   50.0  100.0
28   Winnie   70.0  100.0   70.0

In [4]:
# 국어의 값이 60~90인 학생의 이름, 국어 추출
df[
    (df['kor']>=60)&(df['kor']<=90)
][['name','kor']]

NameError: name 'df' is not defined

### 특정 값을 가진 데이터만 추출
- 컬럼.isin(값리스트)

In [69]:
# 이름이 Amy인 데이터 추출
df[df['name']=='amy']
df[df['name'].isin(['amy'])]

Empty DataFrame
Columns: [name, kor, eng, math]
Index: []

In [70]:
# 이름이 Amy, james인 데이터 추출
df[df['name'].isin(['amy','james'])]

Empty DataFrame
Columns: [name, kor, eng, math]
Index: []

In [71]:
# 국어가 50,100 데이터 추출
df[df['kor'].isin([50,100])]

       name    kor    eng   math
0     Aiden  100.0   90.0   95.0
3      Evan  100.0  100.0  100.0
8    Justin   50.0   60.0  100.0
9     Kevin  100.0  100.0   90.0
12    Peter  100.0   95.0  100.0
15    Danna  100.0  100.0  100.0
19     Kate   50.0    NaN   50.0
20    Linda  100.0   90.0  100.0
23    Sofia  100.0  100.0  100.0
26  Viviana  100.0   80.0  100.0

### null 여부에 따른 데이터 추출
- 컬럼.isnull() -> 해당 컬럼의 값이 null인 데이터 추출
- 컬럼.notnull() -> 해당 컬럼의 값이 null이 아닌 데이터 추출

In [76]:
# 국어가 null인 데이터 추출
df[df['kor'].isnull()]
df[df.kor.isnull()]

      name  kor   eng   math
4    Henry  NaN  35.0   60.0
16   Ellen  NaN  60.0    NaN
27  Vikkie  NaN  50.0  100.0

In [77]:
# 국어가 null이 아닌 데이터 추출
df[df['kor'].notnull()]

        name    kor    eng   math
0      Aiden  100.0   90.0   95.0
1    Charles   90.0   80.0   75.0
2     Danial   95.0  100.0  100.0
3       Evan  100.0  100.0  100.0
5        Ian   90.0  100.0   90.0
6      James   70.0   75.0   65.0
7     Julian   80.0   90.0   55.0
8     Justin   50.0   60.0  100.0
9      Kevin  100.0  100.0   90.0
10       Leo   90.0   95.0   70.0
11    Oliver   70.0   75.0   65.0
12     Peter  100.0   95.0  100.0
13       Amy   90.0   75.0   90.0
14     Chloe   95.0  100.0   95.0
15     Danna  100.0  100.0  100.0
17      Emma   70.0   65.0   70.0
18  Jennifer   80.0   55.0   80.0
19      Kate   50.0    NaN   50.0
20     Linda  100.0   90.0  100.0
21    Olivia   90.0   70.0   90.0
22      Rose   70.0   65.0   70.0
23     Sofia  100.0  100.0  100.0
24   Tiffany   90.0    NaN   90.0
25   Vanessa   95.0   70.0   95.0
26   Viviana  100.0   80.0  100.0
28    Winnie   70.0  100.0   70.0
29      Zuly   80.0   90.0   95.0

In [78]:
df[df.math.isnull()]

     name  kor   eng  math
16  Ellen  NaN  60.0   NaN